{"pages":[{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/Hexo/Hello_Hexo/"},{"title":"程序员面试攻略 —— 薪资谈判","text":"这篇文章是自己在面试准备中，参照他人经验以及自身总结经历的随笔。希望读者在看完全文后，也能留下你们的经验。我万分荣幸能收到你们的消息。 —— MinRam 一、谈工资需要谈工资，就是要钱，赤裸裸要钱，要完钱后还是要钱。整个过程需要承担一定的风险，存在谈崩的可能。 如果觉得工资是由能力决定的，公司会根据自己能力很公平的裁定的人，大可跳过这个回答。 比如我，把自己比喻成商品，信奉市场供需关系。不是公司单方面决定我的工资，定期准备面试，保证自己的市场竞争能力。 二、谈工资的人群如果你是实习生&amp;应届生，那谈工资的空间并不大，那俩都是差不多的背景，拿IT类职位，一年收入差距大概一两万。如果是经验丰富的，能通过谈薪提高几万年薪。 不过我自己还是建议尽早开始练习谈薪，毕竟这样的机会不多，为未来的自己提前练习谈薪资。薪资是一步步往上提高的，每一步都要争取最大利益化。（谈薪过程巨刺激） 三、公司方面的面试成本有个指标叫做CPH (cost per hire)，人均招聘成本。招聘一个合格工程师，需要花费多个款项，包括简历来源、招聘工具、中介代理费、候选人的差旅和住宿、招聘活动开支。 除此之外，还包括招聘团队的薪资，鼓励奖金，甚至是技术面开发人员带薪面试。（打断一个有面试能力的开发人员去组织面试，需要花费更多的时间让他回归到原来的工作上) 加上并不是每次应聘者都能符合要求，拿到offer。或者是拿到offer的应聘者，最后也有一定的概率拒绝offer。当你拿到offer时，公司已经在你身上花费了很多时间和钱。 另外负责跟你交接的HR，可以了解他们薪资体系，绩效奖金（入职率）占据他们大部分的薪水。他们具有很强的动力，撮合你和公司的缘分。（听说有的公司会选择第二个HR来谈薪，避免这种事情。） 综上，如果你通过了面试，拿到offer，公司内部所有人都希望你能接受，而不是拒签。 四、公司初步定薪套路每个职位，都有对应的级别，以及相应级别的薪资范围，同样的级别也会有高薪低薪之分。另外同样的职位，绝大部分不会给上限工资，这涉及到公司的工资预算。 HR给的offer数字，会考虑： 能低价就低价（大部分人就这样被牵着鼻子走） 会给后面的提薪留余地（如果你有讨价的话） 太低了，可能会直接被拒。 HR往往会依照明确的参考标准（比如不断询问你当前的薪资水平），再加上一定的涨幅出价。 注意，HR并不会根据你的能力出价的。能力是个不可以客观量化的东西。仅仅通过面试是很难考察出一个人的真正能力（面试表现好≠工作能力好）。 另外，你的老雇主出10万就能招到你，我司为何要出20万甚至30万？增加20%，一年给12万就很好了。还有，你为什么只值10万？是不是能力其实也就那么回事啊。尤其是好多年没跳槽的人，是不是没有能力拿高薪？这些想法未必正确，但是从公司的角度来看，有这些疑问，不算过分。 再给出几个不同角度的参考因素： 不利的一面： 应聘旺季，如春招秋招，公司有较多的候补人，此时供大于需，公司大概率不在乎你。 应届毕业生，应届毕业生的工资，一般有经验的HR都能猜到，回到明确参考标准那点。 老钉子户，由于长时间未挪窝，基本丧失市场竞争力，HR就会按市场平均水平直接给。（当然，对于资深高级人员，往往通过猎头来寻求谈判。） 进城户，之前的生活消费水平低，迁移到较好的城市，这种对于HR会给较低薪资，因为好打发。 有利的一面： 缺人的岗位&amp;技能，意味着你是个香饽饽，卖方市场，会有多家公司抬价。 海王，待过多家公司（非负面记录），工作多年，经验老道，HR猜不到你工资。 大公司背景，会给HR足够的俯视压力。 公司周边基建因素，诸如当前国内存在大公司往郊区迁移，周边配套服务往往不足。 还有其他的因素，不一一例举。以上也能作为就业参考因素。 五、谈判前的准备工作 合理安排面试时间，能保障手上有多份Offer。多份Offer在手，方便比较竞价。同时就算谈崩了，也有其他offer，能走选择的余地。如何合理安排时间，就需要考虑到公司的招聘速度。这个参考对应面经，或直接询问hr即可。 说下公司竞价的原因，之前提过，一场面试并不能衡量一个人的各方面素质，能满足职位要求。每家公司都出现过，招聘后不能给出有效产能的员工，最后只能开除或者内部调岗。 然而，如果你拿到了多家公司的Offer，得到多家公司的认可，这就是一个很强的信号。经过了多轮面试的考研，大家都认可。公司非常愿意高价招手握一把Offer、大家都说好的求职者。 不透露当前工资水平。对这个就是，不说，不谈，不填。 大部分公司是不能看到前东家薪资的。（进去背调后才会要求工资流水）没必要说，也没必要虚报，不说就行。工资是根据当前的背景和经验决定的，选择了寻找新公司，就说明当前薪资是不满足自己的价值的。那新公司又有啥理由，以此为借口继续打压？ 六、谈判Tips在公司已经给出具体工资数字情况下，如何继续讨价还价 双方保持兴趣是前提 如果你没兴趣加入这家公司，甚至对公司的前景不看好。那就算你再牛叉，对公司来说，招聘你并不会带来任何收益。公司会果断取消Offer。你需要对公司有强烈的兴趣，这样公司才会反过来“追”你，甚至愿意让步加价。即使后面双方意见不一致，也不至于留有坏印象。 对于一家公司，去什么样的小组，公司环境和发展机会，甚至公司的未来计划如何，都是选择Offer的重要因素。入职前，能从不同角度去看待公司，从不同的渠道收集信息，能提前预防你踩坑。 公司文化，可以参照各种新闻对公司的介绍。公司在意什么，领导强调什么，那就是他们的公司文化。说“好”就完事。 沉住气，不要当场答应 无论对方给出什么样的总包，即便是惊喜，即便是大牛公司，即便是你现在唯一的Offer，也不要立马答应，因为任何时候都是有讨价还价的地步。HR并不期望当场拿到答复，他们告诉你的同时也做好了收到拒Offer的消息。 对于HR，为了能促使你接受Offer，HR甚至会主动加价，沉住气没准你每年能拿到更多的钱。 多听少说 当你拿到Offer，进入了谈薪资的阶段时候，注意要多听少说。 HR行业门槛普遍较低，可以发现很多是文科出身，毕业没多久的妹子，当然这不包括经验老练的猎头。沟通，是一件细活，你需要留意她们说的每一句话，每一个字，也许她们无意之间会透露很多信息给你。沉默是金，让对方多揣测你的心思，出昏招。我们需要足够的信息来支撑我们接下来的谈判。 比如： 谈到薪资的时候，你沉默不语，她可能回了一句，“你对股票还满意么？”，你可以从中得出股票部分还有提升空间。 谈到部门招聘计划，HR答复有很大的招聘计划，你可以从中得出公司迫切填补当前的人力需求。综上这些，我们在接下来的谈判都会更有底气 书面确定工资数目 大部分的公司，会随着Offer会发一个正式的邮件通知。而有的公司，只会电话口头Offer。口头Offer，意味着缺少法律效应，即便入职后公司基于的薪资不一致，你也无从谈起。 为了防止公司“理解有误”，也为了防止公司“将来反悔”，我们还是要想方设法在入职前，拿到这份正式的Offer邮件。或者自己主动发送这封邮件，如果对方答复了，也是具有法律效应的。 关于程序员薪资组成，我会在后续出单篇描述。 按照自己的节奏进行 仅限于跳槽的同学们。对于第一份offer，自身还是比较被动的，只能适应他们的节奏。 HR往往乐意逼着我们接Offer，比如两天内给答复。对于这种，只有两个字，没门！至于拒绝的理由也是显而易见的，拖家带口、外地搬家（卖房子，子女上学，配偶工作等）、多份Offer(综合考虑) 牢记一个原则： 我们值得这个价，而且现在我们是在选择更好的机会,而不只是为了饭碗。公司如果想招揽我们，就需要拿出足够的诚意。 催其他公司给offer 谈判最有力的手段，就是多家公司竞价。 在收到A公司的Offer后，转头找B要Offer，催着他们，千万不要等着他们答复。如果A公司的Offer有分量，你可以跟B公司摆摆。在过程中，会有HR让你透露下其他Offer的薪资，你只要牢记对每家公司都透露，自己强烈的兴趣，再拿其他更高的Offer比较。没准公司就咬咬牙加价了。 整个过程，就跟菜市场讲价一样，如果你精通此道，那必定手到擒来。中间有很多细节需要自己慎重处理，但一定要内心强大，坚持下来，没准接下来你能谈出一辆奔驰🚗（就只动动嘴）。 七、offer的选择 Offer的选择，需要结合自己的情况思考。这里只是我个人的遇到的一些情况。 薪资， 薪资一般包括：基础工资（Base Salary)、奖金（Bonus)和期权（Stock）。 可以找个在线薪资计算器，大概计算每年的收益多少。以及包括税前税后的收入是否满足自己的期望。 五险一金， 国内和国外企业在这一方面的待遇相差较多，特别是住房公积金这一条。主要作为国内和国外企业Offer的考虑点。 上市公司， 相比没上市公司，存在很大的不确定性。如股票的估值，上市6个月后才能套现股票，以及公司的发展前景。当然，也存在等公司上市后，股票套现，实现财务自由。这点回到之前自己对公司的了解和发展的预判。 另外，假若如果只是考虑跳板因素，则更多的是考虑职位和领域，能给下一次提供更好的经验。 职位， 职位涉及的领域，决定了你下一份工作的方向和范围。选择的这段经历，将作为转行管理的跳板，未来高升的积累。这里建议多考虑长远目标。 凡是没有立即兑现的，都是虚无的，就当没有给。 画饼永远都是老板的手段，如果兑现了，得偿所愿。那没有兑现呢？你就真白打工了。 八、最后薅一把 无论对方给你什么数字，就算满足你的期望，也不建议你当场答应。玩的就是心理战，没准最后关头，公司给你加个红包，比如签字费涨几万等等。 >—— 码字不易，已阅留爪 (ฅ´ω`ฅ) ——","link":"/%E7%A8%8B%E5%BA%8F%E5%91%98%E9%9D%A2%E8%AF%95%E6%94%BB%E7%95%A5/InterviewSalary/"},{"title":"程序员面试攻略 —— 简历","text":"参考 [1] The Google Résumé: How to Prepare for a Career and Land a Job at Apple, Microsoft, Google, or any Top Tech Company","link":"/%E7%A8%8B%E5%BA%8F%E5%91%98%E9%9D%A2%E8%AF%95%E6%94%BB%E7%95%A5/InterviewResume/"},{"title":"程序员面试攻略 —— 薪资构成","text":"这篇文章是自己在面试准备中，参照他人经验以及自身总结经历的随笔。希望读者在看完全文后，也能留下你们的经验。我万分荣幸能收到你们的消息。 —— MinRam 前言开篇时候膜一下《中国人民共和国劳动法》。 吐槽下官网互联网建设不足，急需IT人才~ 一、薪水构成科技公司的小伙伴们会用 TC (Total Compensation)，来表示实际收入总包裹大小。TC 的计算方法各公司稍有不同，但无外乎包括以下几个部分： 基本工资 Base (五险一金、个人收入所得税) 年终奖 Bonus 股票 Equity (RSU/Option) 初始股票 Initial grant 新发股票 Refresh 而再详细点 二、看得到的工资2.1 基础工资 Base Salary这是在入职合同上填写的固定收入，具体是根据入职时候的市场价、面试表现、职位等级决定的。入职后将随公司策略有一定的涨幅。 可以理解为，这是公司每个月给我们的月薪。在扣除五险一金，工资税后，剩下的会转账到个人工资卡上，也就是你实际到手的金额。 工资税的计算， 可以查看 中华人民共和国个人所得税法, 可以通过个人所得税APP查看， 从当地的本地宝公众号查询。回复“个税”，可以直接进入个人所得税入口。 五险一金，查看下文。 2.2 年终奖 Bonus 年终奖，是老板给予员工一年来的工作业绩奖励，一般位于年末到年初时候发放。 年终奖主要用来奖励员工一年的业绩表现， 以及摁住员工跳槽的念头。所以我们可以从一年的年终奖看出公司对你的期待。往往年终奖发完的这一阶段，是你进行离职或者跳槽的最佳时间。 年终奖上不封顶，一般为月薪的2个月。 年终奖也是同样需要缴纳个人所得税的。可以查看 国家税务总局关于调整个人取得全年一次性奖金等计算征收个人所得税方法问题的通知。 2.3 股票 Restricted Stock Units股票收入主要包含两部分： 初始合同一次性承诺给予，分四年（或五年）按月/季度/年发放 各公司政策稍有不同，有些公司在员工入职一年后才开始按季度发（业内叫 one-year cliff），而有些公司入职第一个月就开始发 不是所有公司都等额发放，比如亚麻头两年 5% 和 15%，后面两年各 40%，Snap 也有类似规定 每年新发 Reflesh 每过一年，公司会根据员工表现，新发一定股票，同样也是分四年发完 新入职第一年，不是所有公司都给 refresh Uber 把 refresh 当成 bonus 的一部分，分 cash bonus 和 stock bonus 各家公司 refresh 规定都不太一样，会随着市场情况调整，具体情况具体讨论 另外在司期间，对于上市公司，可以行使公司股票的购买权（以某个特定价格购买股票的权力） 个人觉得股票避税的两种方式： 等你老了没有这么高工资了再卖，这样capital gain tax braket 比较低（因为交易税和收入税挂钩 如果你有多支股票的话，找机会卖一个亏损的，claim capital gain loss， 然后再卖这个赚钱的，这样两两相抵。 2.4 五险一金 five-insurance payment 再膜一下 《中华人民共和国社会保险法》 五险一金是指用人单位给予劳动者的集中保障性待遇的合称，包括【五险】（养老保险、医疗保险、失业保险、工伤保险、生育保险）和【一金】（住房公积金）。 缴纳基数是社保计算的基数，决定了五险一金的缴纳金额。新入职员工是以起薪当月月收入作为缴纳基数，入职一年以上的员工以上一年月平均收入作为缴纳基数。 养老保险 (企业 + 个人共同缴纳) 是国家根据法律、法规的规定，强制建立和实施的一种社会保险制度。 在达到法定退休年龄，且累积缴纳养老保险费满15年。 由社保机构每月给你发放的养老金。取决于你交社保的年限，每月缴纳金额，户籍地，职称等决定。 医疗保险（企业 + 个人共同缴纳） 失业保险（企业 + 个人共同缴纳） 工伤保险（企业缴纳） 生育保险（企业缴纳） 住房公积金 三、看不到的工资除了以上提到几点，刚入职是还会有一笔现金签字费，入职后一定时间内支付，主要由 negotiation（有无 competing offer、公司多么想招你）决定。 另外，还有各大科技公司著名的好福利，比如健康保险、免费的一日三餐、健身房、游泳池，博物馆免费门票/打折票，车险、房屋保险、租车、买车、滑雪等一系列的 corporate rate，免费/打折的衣服干洗、理发、体检，commuter benefit 报销上下班公共交通，等等。 例外，大公司里面： 微软、亚麻和苹果没有免费食堂（部分 office 有，个人认为自己掏钱是好事） Netflix 的福利，是给员工 all cash，很多很多 cash","link":"/%E7%A8%8B%E5%BA%8F%E5%91%98%E9%9D%A2%E8%AF%95%E6%94%BB%E7%95%A5/InterviewIncoming/"},{"title":"","text":"","link":"/uncategorized/CSharp_Introduce/"}],"tags":[{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"面试","slug":"面试","link":"/tags/%E9%9D%A2%E8%AF%95/"},{"name":"程序员面试攻略","slug":"程序员面试攻略","link":"/tags/%E7%A8%8B%E5%BA%8F%E5%91%98%E9%9D%A2%E8%AF%95%E6%94%BB%E7%95%A5/"}],"categories":[{"name":"Hexo","slug":"Hexo","link":"/categories/Hexo/"},{"name":"程序员面试攻略","slug":"程序员面试攻略","link":"/categories/%E7%A8%8B%E5%BA%8F%E5%91%98%E9%9D%A2%E8%AF%95%E6%94%BB%E7%95%A5/"}]}